---
kind: property
id: P:Autodesk.Revit.DB.FootPrintRoof.ExtendIntoWall(Autodesk.Revit.DB.ModelCurve)
source: html/9d0ca9df-3bc7-e7b5-9657-2ee6261bc85f.htm
---
# Autodesk.Revit.DB.FootPrintRoof.ExtendIntoWall Property

Retrieve or set whether extend into wall the curve.

## Syntax (C#)
```csharp
public bool this[
	ModelCurve pCurve
] { get; set; }
```

## Parameters
- **pCurve** (`Autodesk.Revit.DB.ModelCurve`)

## Remarks
Only applicable when the FootPrintRoof is created with Pick Walls.